//записываем вложенные массивы в 0-ой ячейке - наименование товара, в ячейке 1 - стоимость, в ячейке 2 - количество.
var itemsBasket = [["товар №1",300,3],
["товар №2",100,8],
["товар №3",200,7],
["товар №4",150,4],
["товар №5",40,15],
["товар №6",10,2],
["товар №7",500,3],
["товар №8",400,1],
["товар №9",600,2],
["товар №10",200,4],]
//Функция по подсчету стоимости корзины
function countBasketPrice(x) {
	var i = 0;
	var sum = 0;
	while(i <=(x.length - 1)) {
		var m = +x[i][1];
		var n = +x[i][2];
		var sum = sum + (m * n);
		i++;
	}
	return sum;
}
//вывод

console.log(countBasketPrice(itemsBasket));